# по времени выполнения скрипта пузырьковая сортировка всегда больше ~0.1 сек

import timeit

def buble_sort(arr):
    n = len(arr)
    for i in range(n):
        swapped = False
        for j in range(0, n - i - 1):
            if arr[j] > arr[j + 1]:
                arr[j], arr[j + 1] = arr[j + 1], arr[j]
                swapped = True
        if not swapped:
            break
    return arr

def selected_sort(arr):
    n = len(arr)
    for i in range(n):
        min_index = i
        for j in range(i+1, n):
            if arr[j] < arr[min_index]:
                min_index = j
        arr[i], arr[min_index] = arr[min_index], arr[i]
    return arr




s = """def err_def():
    arr_hundred = [11, 98, 351, 193, 238, 111, 263, 105, 367, 292, 74, 257, 67, 320, 344, 420, 89, 377, 293, 59, 325, 402,
                   39, 143, 358, 271, 30, 359, 73, 474, 116, 178, 482, 34, 476, 201, 490, 191, 101, 163, 159, 455, 236, 296,
                   206, 202, 21, 464, 218, 114, 118, 486, 344, 450, 71, 458, 257, 368, 98, 124, 164, 174, 266, 7, 203, 318,
                   43, 338, 278, 89, 69, 287, 8, 256, 460, 181, 125, 496, 452, 380, 326, 357, 137, 157, 14, 382, 116, 179,
                   131, 445, 220, 112, 388, 117, 10, 261, 285, 492, 298, 440, 451]
    print(f'>>> {selected_sort(arr)}')"""
b = """def err_def():
    arr_hundred = [11, 98, 351, 193, 238, 111, 263, 105, 367, 292, 74, 257, 67, 320, 344, 420, 89, 377, 293, 59, 325, 402,
                   39, 143, 358, 271, 30, 359, 73, 474, 116, 178, 482, 34, 476, 201, 490, 191, 101, 163, 159, 455, 236, 296,
                   206, 202, 21, 464, 218, 114, 118, 486, 344, 450, 71, 458, 257, 368, 98, 124, 164, 174, 266, 7, 203, 318,
                   43, 338, 278, 89, 69, 287, 8, 256, 460, 181, 125, 496, 452, 380, 326, 357, 137, 157, 14, 382, 116, 179,
                   131, 445, 220, 112, 388, 117, 10, 261, 285, 492, 298, 440, 451]
    print(f'>>> {buble_sort(arr)}')"""

print(timeit.timeit(stmt=s, number=100))
print(timeit.timeit(stmt=b, number=100))